
# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4
  - [-1, 1, space_to_depth, [2]]  # 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 1]] # 4-P3/8
  - [-1, 1, space_to_depth, [2]]  # 5
  - [-1, 2, C3k2, [512, False, 0.25]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]]  # 8
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]] # 10
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

# YOLO11n head
head:
  - [-1, 1, CARAFE, [512, 3, 2]]  # 13
  - [[-1, 8], 1, Concat, [1]] # 14 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 17 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]  # 20 cat backbone P2
  - [-1, 3, C3k2, [128, False]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 18], 1, Concat, [1]] # 23 cat head P3
  - [-1, 2, C3k2, [512, False]] # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 15], 1, Concat, [1]]  # 26 cat head P4
  - [-1, 2, C3k2, [512, False]]  # 27 (P5/32-large

  - [-1, 1, Conv, [512, 3, 2]]  # 28
  - [[-1, 12], 1, Concat, [1]] # 29 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 30 (P5/32-large)

  - [[21, 24, 27, 30], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)