
# Parameters
nc: 6 # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4
  - [-1, 1, space_to_depth, [2]]  # 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 1]] # 4-P3/8
  - [-1, 1, space_to_depth, [2]]  # 5
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 1]] # 7-P4/16
  - [-1, 1, space_to_depth, [2]]  # 8
  - [-1, 2, C3k2, [512, True]]  # 9
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]] # 15 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 6], 1, Concat, [1]] # 18 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 19 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 20
  - [[-1, 3], 1, Concat, [1]]  # 21 cat backbone P2
  - [-1, 3, C3k2, [128, False]]  # 22 (P4/16-medium)


  - [-1, 1, Conv, [256, 3, 2]]  # 23
  - [[-1, 19], 1, Concat, [1]] # 24 cat head P3
  - [-1, 2, C3k2, [512, False]] # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 26
  - [[-1, 16], 1, Concat, [1]]  # 27 cat head P4
  - [-1, 2, C3k2, [512, False]]  # 28 (P5/32-large

  - [-1, 1, Conv, [512, 3, 2]]  # 29
  - [[-1, 13], 1, Concat, [1]] # 30 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 31 (P5/32-large)

  - [[22, 25, 28 , 31], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)