
nc: 6 # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4
  - [-1, 1, space_to_depth, [2]]  # 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]]  # 7
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 7], 1, Concat, [1]] # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 5], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 18
  - [[-1, 3], 1, Concat, [1]]  # 19 cat backbone P2
  - [-1, 3, C3k2, [128, False]]  # 20 (P4/16-medium)


  - [-1, 1, Conv, [256, 3, 2]]  # 21
  - [[-1, 17], 1, Concat, [1]] # 22 cat head P3
  - [-1, 2, C3k2, [512, False]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 24
  - [[-1, 14], 1, Concat, [1]]  # 25 cat head P4
  - [-1, 2, C3k2, [512, False]]  # 26 (P5/32-large

  - [-1, 1, Conv, [512, 3, 2]]  # 27
  - [[-1, 11], 1, Concat, [1]] # 28 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 29 (P5/32-large)

  - [[20, 23, 26, 29], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)